SELECT НТВ."ИД", "Н_ВЕДОМОСТИ"."ИД"
FROM "Н_ВЕДОМОСТИ"
    RIGHT JOIN "Н_ТИПЫ_ВЕДОМОСТЕЙ" НТВ ON "Н_ВЕДОМОСТИ"."ТВ_ИД" = НТВ."ИД"
WHERE НТВ."ИД" = '1'
    AND "Н_ВЕДОМОСТИ"."ДАТА" = '2010-06-18'
    AND "Н_ВЕДОМОСТИ"."ДАТА" > '1998-01-05';
-------------------------------------------------------------------
SELECT "Н_ЛЮДИ"."ИМЯ", НВ."ЧЛВК_ИД", НВ."ЧЛВК_ИД"
FROM "Н_ЛЮДИ"
    RIGHT JOIN "Н_ВЕДОМОСТИ" НВ ON "Н_ЛЮДИ"."ИД" = НВ."ЧЛВК_ИД"
    RIGHT JOIN "Н_СЕССИЯ" НС ON НВ."СЭС_ИД" = НС."СЭС_ИД"
WHERE "Н_ЛЮДИ"."ИМЯ" < 'Ярослав'
    AND НВ."ЧЛВК_ИД" = '163249';
---------------------------------------------------------------
SELECT "ОТЧЕСТВО"
FROM "Н_ЛЮДИ"
WHERE ("ОТЧЕСТВО")
    IN (SELECT "ОТЧЕСТВО"
        FROM "Н_ЛЮДИ"
        GROUP BY "ОТЧЕСТВО" HAVING COUNT(*)=1)
ORDER BY "ОТЧЕСТВО";
-----------------------------------------------------------
-- ФИО        |СКОЛЬКО ЛЕТ|СКОЛЬКО СРЁТ
-- Данилка    |13         |100000 кг
-- Валакас    | 54        |13 кг
-- Амогус     | 0         |69 кг
-- Егорка     | 13        |15 кг
-- Блум       | 19        | 0 кг
----------------------------------------------
SELECT groups."ГРУППА", groups.student_count
FROM(
    SELECT "ГРУППА", COUNT(*) AS student_count
    FROM "Н_УЧЕНИКИ" НУ
        JOIN "Н_ПЛАНЫ" НП ON НУ."ПЛАН_ИД" = НП."ИД"
            AND НП."УЧЕБНЫЙ_ГОД" = '2010/2011'
        JOIN "Н_ОТДЕЛЫ" НО ON НП."ОТД_ИД" = НО."ИД"
            AND НО."КОРОТКОЕ_ИМЯ" = 'КТиУ'
    GROUP BY "ГРУППА") AS groups
WHERE groups.student_count = 10;
----------------------------------------------
SELECT НУ."ГРУППА", AVG(DATE_PART('year', AGE(НЛ."ДАТА_РОЖДЕНИЯ")))
FROM "Н_УЧЕНИКИ" НУ
  JOIN "Н_ЛЮДИ" НЛ ON НЛ."ИД" = НУ."ЧЛВК_ИД"
GROUP BY НУ."ГРУППА"
HAVING AVG(DATE_PART('year', AGE(НЛ."ДАТА_РОЖДЕНИЯ"))) > (
    SELECT AVG(DATE_PART('year', AGE(НЛ."ДАТА_РОЖДЕНИЯ")))
    FROM "Н_УЧЕНИКИ" НУ
      JOIN "Н_ЛЮДИ" НЛ ON НЛ."ИД" = НУ."ЧЛВК_ИД"
    WHERE НУ."ГРУППА" = '1101'
    GROUP BY НУ."ГРУППА"
    );
----------------------------------------------------
SELECT НУ."ГРУППА", НУ."ИД", НЛ."ФАМИЛИЯ", НЛ."ИМЯ", НЛ."ОТЧЕСТВО", НУ."П_ПРКОК_ИД", НУ."СОСТОЯНИЕ"
FROM "Н_ЛЮДИ" НЛ
    JOIN "Н_УЧЕНИКИ" НУ ON  НУ."ЧЛВК_ИД" = НЛ."ИД"
WHERE НЛ."ИД" IN (SELECT НУ."ЧЛВК_ИД"
FROM "Н_УЧЕНИКИ" НУ
    WHERE НУ."ПЛАН_ИД" IN (SELECT "Н_ПЛАНЫ"."ПЛАН_ИД"
                           FROM "Н_ПЛАНЫ"
                           WHERE "Н_ПЛАНЫ"."ФО_ИД" IN (SELECT "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                                       FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                                                       WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
                                                         )
                             AND "Н_ПЛАНЫ"."НАПС_ИД" IN (SELECT "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
                                                         FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
                                                         WHERE "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" IN (SELECT "Н_НАПР_СПЕЦ"."ИД"
                                                                                                   FROM "Н_НАПР_СПЕЦ"
                                                                                                   WHERE "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101')

                               )
                             AND "Н_ПЛАНЫ"."КУРС" = 1
                             )
    AND DATE(НУ."НАЧАЛО") > '2012-09-01');

SELECT НУ."ЧЛВК_ИД"
FROM "Н_УЧЕНИКИ" НУ
    WHERE НУ."ПЛАН_ИД" IN (SELECT "Н_ПЛАНЫ"."ПЛАН_ИД"
                           FROM "Н_ПЛАНЫ"
                           WHERE "Н_ПЛАНЫ"."ФО_ИД" IN (SELECT "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                                       FROM "Н_ФОРМЫ_ОБУЧЕНИЯ"
                                                       WHERE "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Заочная'
                                                         )
                             AND "Н_ПЛАНЫ"."НАПС_ИД" IN (SELECT "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."ИД"
                                                         FROM "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"
                                                         WHERE "Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ"."НС_ИД" IN (SELECT "Н_НАПР_СПЕЦ"."ИД"
                                                                                                   FROM "Н_НАПР_СПЕЦ"
                                                                                                   WHERE "Н_НАПР_СПЕЦ"."КОД_НАПРСПЕЦ" = '230101')

                               )
                             AND "Н_ПЛАНЫ"."КУРС" = 1
                             )
    AND DATE(НУ."НАЧАЛО") > '2012-09-01';