--Задание 1
SELECT Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД, Н_ВЕДОМОСТИ.ДАТА
FROM Н_ТИПЫ_ВЕДОМОСТЕЙ
RIGHT JOIN Н_ВЕДОМОСТИ ON Н_ТИПЫ_ВЕДОМОСТЕЙ.ИД = Н_ВЕДОМОСТИ.ТВ_ИД
WHERE Н_ТИПЫ_ВЕДОМОСТЕЙ.НАИМЕНОВАНИЕ < 'Ведомость'
AND Н_ВЕДОМОСТИ.ЧЛВК_ИД = 163249;


--Задание 2
SELECT Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ГРУППА
FROM Н_ЛЮДИ
RIGHT JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ИД
RIGHT JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
WHERE Н_ЛЮДИ.ФАМИЛИЯ < 'Ёлкин'
AND Н_ОБУЧЕНИЯ.НЗК = '001000'
AND Н_УЧЕНИКИ.ИД = 150308;

--Задание 3
SELECT COUNT(*) AS count
FROM (
    SELECT Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
    FROM Н_ЛЮДИ
    GROUP BY Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ОТЧЕСТВО
    HAVING COUNT(*) > 1
) AS duplicates;

--Задание 4
SELECT g.ГРУППА FROM Н_ГРУППЫ_ПЛАНОВ as g
INNER JOIN Н_УЧЕНИКИ as u ON g.ГРУППА = u.ГРУППА
INNER JOIN Н_ПЛАНЫ as p ON g.ПЛАН_ИД = p.ИД
INNER JOIN Н_ОТДЕЛЫ as o ON p.ОТД_ИД = o.ИД
WHERE p.УЧЕБНЫЙ_ГОД IN ('2010/2011', '2011/2012')
	  AND o.КОРОТКОЕ_ИМЯ = 'КТиУ'
GROUP BY g.ГРУППА
HAVING COUNT(u.ИД) = 5;

--Задание 5
SELECT УЧЕНИКИ.ГРУППА AS "ГРУППА",
       (Select max(extract(YEAR FROM age(Н_ЛЮДИ.ДАТА_РОЖДЕНИЯ)) :: INTEGER) AS "СРЕДНИЙ ВОЗРАСТ"
        FROM Н_УЧЕНИКИ
                 JOIN Н_ЛЮДИ ON (Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД)
        WHERE (Н_УЧЕНИКИ.ГРУППА = '1100')) AS "СРЕДНИЙ ВОЗРАСТ"
FROM Н_УЧЕНИКИ AS УЧЕНИКИ
GROUP BY (УЧЕНИКИ.ГРУППА);

--Задание 6
SELECT S.ГРУППА AS Номер_Группы, Н_ЛЮДИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, S.П_ПРКОК_ИД AS Номер_Приказа, S.СОСТОЯНИЕ
FROM Н_УЧЕНИКИ S
JOIN Н_ЛЮДИ ON S.ЧЛВК_ИД = Н_ЛЮДИ.ИД
JOIN Н_ПЛАНЫ ON Н_ПЛАНЫ.ИД = S.ПЛАН_ИД
WHERE S.НАЧАЛО = '2012-09-01' AND Н_ПЛАНЫ.КУРС = 1 AND (Н_ПЛАНЫ.ФО_ИД = 1 OR Н_ПЛАНЫ.ФО_ИД = 3);

--Задание 7
SELECT DISTINCT S1.ИМЯ, S1.ДАТА_РОЖДЕНИЯ
FROM Н_ЛЮДИ S1
JOIN Н_ЛЮДИ S2 ON S1.ИМЯ = S2.ИМЯ AND S1.ДАТА_РОЖДЕНИЯ <> S2.ДАТА_РОЖДЕНИЯ;

